Open-Source-Satellite/OSSAT_OBC_Dev_Board/OSSAT OBC Dev Test Software/Core/Src/STM32CAN_ContollerAreaNetwork.c
/***********************************************************************************
 *  @file STM32CAN_ContollerAreaNetwork.c
 ***********************************************************************************
 *   _  _____ ____  ____  _____ 
 *  | |/ /_ _/ ___||  _ \| ____|
 *  | ' / | |\___ \| |_) |  _|  
 *  | . \ | | ___) |  __/| |___ 
 *  |_|\_\___|____/|_|   |_____|
 *
 ***********************************************************************************
 *  Copyright (c) 2022 KISPE Space Systems Ltd.
 *  
 *  www.kispe.co.uk/projectlicenses/RA2001001001
 ***********************************************************************************
 *  Created on: 04-May-2022 11:40:20                      
 *  Implementation of the Class STM32CAN_ContollerAreaNetwork       
 *  @author: Paul Madle                     
 ***********************************************************************************/

#include "STM32CAN_ContollerAreaNetwork.h"

/**
 * This object drives the STM32 CAN module. It does not support CAN-FD or CAN-TT
 * features in the CAN hardware.
 * The driver has the capability to filter received messages using an acceptance
 * filter and mask on the ID or a range of input IDs.
 * The driver assumes that 1 RX FIFIOs and 1 TX FIFO is used to hold the message
 * data. These FIFOs are held in a memory that is shared between the 2 CAN
 * interfaces available on the STM32.
 * Interrupts are enabled on CAN reception (following filters), CAN transmission
 * and on errors.
 */
/* PRIVATE FUNCTIONS */

#ifndef UNIT_TEST


#endif /* UNIT_TEST */



/* PRIVATE ATTRIBUTES */

/**
 * A struct for an extended ID filter element.
 */
typedef struct tsSTM32CAN_ExtendedIDFilterElement
{
	tUINT32 iEFID1:29;
	tUINT32 iEFEC:3;
	tUINT32 iEFID2:29;
	// cppcheck-suppress unusedStructMember
	tUINT32 reserved:1;
	tUINT32 iEFTI:2;
}  tsSTM32CAN_ExtendedIDFilterElement;


/**
 * A struct for a TX FIFO element.
 */
typedef struct tsSTM32CAN_TXFifoElement
{
	tUINT32 iID:29;
	tUINT32 iRTR:1;
	tUINT32 iXTD:1;
	tUINT32 iESI:1;
	// cppcheck-suppress unusedStructMember
	tUINT32 reserved1:16;
	tUINT32 iDLC:4;
	tUINT32 iBPS:1;
	tUINT32 iFDF:1;
	// cppcheck-suppress unusedStructMember
	tUINT32 reserved2:1;
	tUINT32 iEFC:1;
	tUINT32 iMM:8;
	tUINT8 aDataBytes[STM32CAN_FRAME_DATA_MAX_LENGTH];
}  tsSTM32CAN_TXFifoElement;


/**
 * A struct that holds the Rx and Tx complete callback function pointers for a CAN
 * controller.
 */
typedef struct tsSTM32CAN_Callbacks
{
	tFUNC_PTR pTxCallback;
	tFUNC_PTR pRxCallback;
}  tsSTM32CAN_Callbacks;


/**
 * A struct holding the registers for a CAN Controller.
 */
typedef struct tsSTM32CAN_Registers
{
	tUINT32 FDCAN_CREL;
	tUINT32 FDCAN_ENDN;
	tUINT32 reserved1;
	tUINT32 FDCAN_DBTP;
	tUINT32 FDCAN_TEST;
	tUINT32 FDCAN_RWD;
	tUINT32 FDCAN_CCCR;
	tUINT32 FDCAN_NBTP;
	tUINT32 FDCAN_TSCC;
	tUINT32 FDCAN_TSCV;
	tUINT32 FDCAN_TOCC;
	tUINT32 FDCAN_TOCV;
	tUINT32 unused2[4];
	tUINT32 FDCAN_ECR;
	tUINT32 FDCAN_PSR;
	tUINT32 FDCAN_TDCR;
	tUINT32 unused3;
	tUINT32 FDCAN_IR;
	tUINT32 FDCAN_IE;
	tUINT32 FDCAN_ILS;
	tUINT32 FDCAN_ILE;
	tUINT32 unused4[8];
	tUINT32 FDCAN_GFC;
	tUINT32 FDCAN_SIDFC;
	tUINT32 FDCAN_XIDFC;
	tUINT32 unused5;
	tUINT32 FDCAN_XIDAM;
	tUINT32 FDCAN_HPMS;
	tUINT32 FDCAN_NDAT1;
	tUINT32 FDCAN_NDAT2;
	tUINT32 FDCAN_RXF0C;
	tUINT32 FDCAN_RXF0S;
	tUINT32 FDCAN_RXF0A;
	tUINT32 FDCAN_RXBC;
	tUINT32 FDCAN_RXF1C;
	tUINT32 FDCAN_RXF1S;
	tUINT32 FDCAN_RXF1A;
	tUINT32 FDCAN_RXESC;
	tUINT32 FDCAN_TXBC;
	tUINT32 FDCAN_TXFQS;
	tUINT32 FDCAN_TXESC;
	tUINT32 FDCAN_TXBRP;
	tUINT32 FDCAN_TXBAR;
	tUINT32 FDCAN_TXBCR;
	tUINT32 FDCAN_TXBTO;
	tUINT32 FDCAN_TXBCF;
	tUINT32 FDCAN_TXBTIE;
	tUINT32 FDCAN_TXBCIE;
	tUINT32 unused6[2];
	tUINT32 FDCAN_TXEFC;
	tUINT32 FDCAN_TXEFS;
	tUINT32 FDCAN_TXEFA;
	tUINT32 unused7;
	tUINT32 FDCAN_TTTMC;
	tUINT32 FDCAN_TTRMC;
	tUINT32 FDCAN_TTOCF;
	tUINT32 FDCAN_TTMLM;
	tUINT32 FDCAN_TURCF;
	tUINT32 FDCAN_TTOCN;
	tUINT32 FDCAN_TTGTP;
	tUINT32 FDCAN_TTTMK;
	tUINT32 FDCAN_TTIR;
	tUINT32 FDCAN_TTIE;
	tUINT32 FDCAN_TTILS;
	tUINT32 FDCAN_TTOST;
	tUINT32 FDCAN_TURNA;
	tUINT32 FDCAN_TTLGT;
	tUINT32 FDCAN_TTCTC;
	tUINT32 FDCAN_TTCPT;
	tUINT32 FDCAN_TTCSM;
	tUINT32 unused8[112];
	tUINT32 FDCAN_TTTS;
}  tsSTM32CAN_Registers;

/**
 * An array of booleans used to mark the transition to the error active state for
 * both CAN controllers, this is set in the ISR which ensures minimal time in the
 * interrupt routine.
 */
tBOOL abSTM32CAN_TransitionToErrorActive[2];
/**
 * An array of booleans used to mark the transition to the error active passive
 * for both CAN controllers, this is set in the ISR which ensures minimal time in
 * the interrupt routine.
 */
tBOOL abSTM32CAN_TransitionToErrorPassive[2];
/**
 * An array of booleans used to mark the transition to the bus off state for both
 * CAN controllers, this is set in the ISR which ensures minimal time in the
 * interrupt routine.
 */
tBOOL abSTM32CAN_TransitionToBusOff[2];
/**
 * The maximum number of extended filters per CAN controller.
 */
#define STM32CAN_MAX_EXTENDED_FILTERS (64UL)
/**
 * The size of a 29bit extended filter in bytes.
 */
#define STM32CAN_EXTENDED_FILTER_SIZE_BYTES (8UL)
/**
 * The maximum value of an extended filter ID.
 */
#define STM32CAN_EXTENDED_FILTER_ID_MAXIMUM_VALUE (0x1FFFFFFFUL)
/**
 * The maximum number of elements that can be stored in the RX FIFO.
 */
#define STM32CAN_MAX_FRAMES_IN_RX_FIFO (64UL)
/**
 * The size of an RX FIFO element in bytes.
 */
#define STM32CAN_RX_FIFO_ELEMENT_SIZE_BYTES (16UL)
/**
 * The maximum number of elements that can be stored in the TX FIFO.
 */
#define STM32CAN_MAX_FRAMES_IN_TX_FIFO (32UL)
/**
 * The size of a TX FIFO element in bytes.
 */
#define STM32CAN_TX_FIFO_ELEMENT_SIZE_BYTES (16UL)
/**
 * The maximum size of used space in the message RAM, in bytes, per CAN Controller. The RAM is split in
 * half so that each controller gets the same amount.
 */
#define STM32CAN_MESSAGE_RAM_MAX_SIZE_BYTES (5120UL)
/**
 * The start address of the dedicated CAN message RAM.
 */
#define STM32CAN_MESSAGE_RAM_ADDRESS (0x4000AC00UL)
/**
 * A global array of structs containing the Rx and Tx callbacks for each CAN Controller.
 */
tsSTM32CAN_Callbacks atsSTM32CAN_Callbacks[2] = {0};
/**
 * A global array of the last read element of the RX FIFO buffer for each CAN Controller.
 */
tUINT32 aiSTM32CAN_LastElementReadIndex[2] = {0};



/**
 * This initialise routine initialises the specified CAN controller into CAN 2.0B mode. It does not
 * start CAN-TT or CAN-FD features. It allocates memory for the receive FIFO, transmit FIFO and the
 * acceptance filters and leaves the devices in a mode where it is not yet connected to the bus. This
 * allows for the AddFilter routines to configure the acceptance filters ahead of connecting the CAN
 * bus via the Connect routine.
 * @returns SUCCESS unless there is an exception.
 * @throws STM32CAN_BAD_ARGS if any arguments are invalid.
 * @throws STM32CAN_CONNECTED if the CAN node is still connected to the bus.
 * @param tePeripheral: teSTM32CAN_PERIPHERAL: The physical CAN bus to initialise
 * @param pBufferMemory: tUINT32*: A pointer to the buffer memory used by the STM32 CAN controller
 * @param teBaudRate: teSTM32CAN_BAUD_RATE: The Baud rate that CAN bus will be running on.
 * @param iInputClockSpeed: tUINT32: The speed of the clock driving the CAN Hardware. Used to work out
 * the baudrate.
 * @param iNumberOf29bitFilters: tUINT32: The number of 29 bit filters defined in the message memory.
 * @param iNumberOfReceiveFramesInFIFO: tUINT32: The number of received 8 byte frames in the receive
 * FIFO
 * @param iNumberOfTransmitFramesInFIFO: tUINT32: The number of received 8 byte frames in the transmit
 * FIFO
 * @re-entrant: 
 */
teFUNC_STATUS STM32CAN_Initialise(teSTM32CAN_PERIPHERAL tePeripheral, tUINT32* pBufferMemory, teSTM32CAN_BAUD_RATE teBaudRate, tUINT32 iInputClockSpeed, tUINT32 iNumberOf29bitFilters, tUINT32 iNumberOfReceiveFramesInFIFO, tUINT32 iNumberOfTransmitFramesInFIFO)
{
	tsSTM32CAN_Registers* ptsCANRegisters = (tsSTM32CAN_Registers*)tePeripheral;
	tUINT32* pInitialBufferMemory = pBufferMemory;

