Open-Source-Satellite/OSSAT_OBC_Dev_Board/OSSAT OBC Dev Test Software/Core/Src/STM32CAN_ContollerAreaNetwork.c
	// Throw an exception if the requested peripheral isn't valid.
	EH_ASSERT(tePeripheral == CAN_PERIPHERAL_FDCAN1 || tePeripheral == CAN_PERIPHERAL_FDCAN2, STM32CAN_BAD_ARGS, "CAN Init Fail, Invalid CAN peripheral selected.");
	// Throw an exception if the requested number of 29 bit filters exceeds the maximum.
	EH_ASSERT(iNumberOf29bitFilters <= STM32CAN_MAX_EXTENDED_FILTERS, STM32CAN_BAD_ARGS, "CAN Init Fail, requested filters exceeds maximum of 64.");
	// Throw an exception if the requested number of receive frames in the RX FIFO exceeds the maximum.
	EH_ASSERT(iNumberOfReceiveFramesInFIFO <= STM32CAN_MAX_FRAMES_IN_RX_FIFO, STM32CAN_BAD_ARGS, "CAN Init Fail, requested RX FIFO elements exceeds maximum of 64");
	// Throw an exception if the requested number of transmit frames in the TX FIFO exceeds the maximum.
	EH_ASSERT(iNumberOfTransmitFramesInFIFO <= STM32CAN_MAX_FRAMES_IN_TX_FIFO, STM32CAN_BAD_ARGS, "CAN Init Fail, requested TX FIFO elements exceeds maximum of 32.");

	// Work out the size of the TX FIFO section by using the max number of TX FIFO elements requested.
	pBufferMemory += (iNumberOf29bitFilters * STM32CAN_EXTENDED_FILTER_SIZE_BYTES) +
			(iNumberOfReceiveFramesInFIFO * STM32CAN_RX_FIFO_ELEMENT_SIZE_BYTES) +
			(iNumberOfTransmitFramesInFIFO * STM32CAN_TX_FIFO_ELEMENT_SIZE_BYTES);
	// If we've exceeded the max space in message RAM, throw an exception.
	EH_ASSERT((tUINT32)(pBufferMemory - pInitialBufferMemory) <= (tUINT32)STM32CAN_MESSAGE_RAM_MAX_SIZE_BYTES, STM32CAN_BAD_ARGS, "CAN Init Fail, Exceeded Max Space In Message RAM");

	// Throw an exception if the CAN is already connected to the bus. Make a call to STM32CAN_Disconnect() first.
	EH_ASSERT((ptsCANRegisters->FDCAN_CCCR & 0x1UL) == 0x1UL, STM32CAN_CONNECTED, "CAN Init Fail, Still Connected To The Bus.");

	// Set the CCE bit in FDCAN_CCCR register to enable configuration.
	// Setting this bit resets certain registers (refer to page 2488 of the datasheet).
	ptsCANRegisters->FDCAN_CCCR |= 0x2UL;

	// Set the operating mode to normal event-driven.
	ptsCANRegisters->FDCAN_TTOCF &= ~0x3UL;
	// Set the Global Filter Configuration to reject frames that don't match a registered filter.
	ptsCANRegisters->FDCAN_GFC = 0x3FUL;

	// Set the nominal bit timing.
	// input clock is 50MHz
	// prescalar down to 1 tq (/5) time quanta is at 10MHz
	// TSEG1 (7) + TSEG2 (2) + 1 = num Tq in bit time... 1 bit time is at 1Mbps.

	ptsCANRegisters->FDCAN_NBTP = 0;
	ptsCANRegisters->FDCAN_NBTP |= (1 - 1) << 25; // SJW
	ptsCANRegisters->FDCAN_NBTP |= (5 - 1) << 16; // Prescaler
	ptsCANRegisters->FDCAN_NBTP |= (7 - 1) << 8; // TSEG1
	ptsCANRegisters->FDCAN_NBTP |= (2 - 1); // TSEG2

	/* Set up Message RAM
	 * The structure of the Message RAM for this implementation of CAN is like so:
	 * EXTENDED FILTERS
	 * RX FIFO
	 * TX EVENT FIFO
	 */

	// Set the pointer back to the start of the message buffer.
	pBufferMemory = pInitialBufferMemory;

	// Set start address and clear number of extended filters.
	ptsCANRegisters->FDCAN_XIDFC = ((tUINT32)pBufferMemory - STM32CAN_MESSAGE_RAM_ADDRESS) & 0xFFFCUL;
	// Work out the start of the next section (RX FIFO) using the number of filters requested.
	pBufferMemory += (iNumberOf29bitFilters * STM32CAN_EXTENDED_FILTER_SIZE_BYTES);
	// Set start address and number of RX FIFO elements.
	ptsCANRegisters->FDCAN_RXF0C = (((((tUINT32)pBufferMemory - STM32CAN_MESSAGE_RAM_ADDRESS) | (iNumberOfReceiveFramesInFIFO << 16UL))) & 0x7FFFFCUL);
	// Work out the start of the next section (TX FIFO) using the max number of RX FIFO elements requested.
	pBufferMemory += (iNumberOfReceiveFramesInFIFO * STM32CAN_RX_FIFO_ELEMENT_SIZE_BYTES);
	// Set start address and number of TX FIFO elements.
	ptsCANRegisters->FDCAN_TXBC = (((((tUINT32)pBufferMemory - STM32CAN_MESSAGE_RAM_ADDRESS) | (iNumberOfTransmitFramesInFIFO << 24UL))) & 0x3F00FFFCUL);

	// Enable interrupt line 1.
	ptsCANRegisters->FDCAN_ILE = 0x2UL;
	// Attach interrupts for changing error passive and bus off states to interrupt line 1.
	ptsCANRegisters->FDCAN_ILS = 0x2800000UL;
	// Enable interrupts for changing error passive and bus off states.
	ptsCANRegisters->FDCAN_IE = 0x2800000UL;

	// Clear INIT bit to finish initialisation and connect to the bus. This is performed by calling STM32CAN_Connect()

	return BT_SUCCESS;

STM32CAN_BAD_ARGS:
	return BT_FAIL;
STM32CAN_CONNECTED:
	return BT_FAIL;
}

/**
 * This routine queues an amount of messages for transmission by placing them in the TX FIFO. Only
 * data frames can be transmitted (Remote frames are not supported).
 * @throws STM32CAN_TX_FIFO_FULL if there is no more room in the transmit FIFO
 * @returns SUCCESS unless there is an exception.
 * @param tePeripheral: teSTM32CAN_PERIPHERAL: The transmission will go from this physical CAN bus.
 * @param atsCanFrame[]: tsSTM32CAN_Frame: The CAN frames for transmission.
 * @param iNumberOfFrames: tUINT32: The number of CAN frames to transmit.
 * @re-entrant: 
 */
teFUNC_STATUS STM32CAN_Transmit(teSTM32CAN_PERIPHERAL tePeripheral, tsSTM32CAN_Frame atsCanFrame[], tUINT32 iNumberOfFrames)
{
	tsSTM32CAN_Registers* ptsCANRegisters = (tsSTM32CAN_Registers*)tePeripheral;
	tsSTM32CAN_TXFifoElement* ptsNewTxElement = {0};
	tUINT32 iNewElementAddressOffset = 0;
	tUINT32 iNewElementNumber = 0;
	tUINT32 iFrameCounter = 0;
    tUINT32 iDataByteCounter = 0;
    tUINT32 iLowerFourBytes = 0;
    tUINT32 iUpperFourBytes = 0;

	// Throw an exception if the requested peripheral isn't valid.
	EH_ASSERT(tePeripheral == CAN_PERIPHERAL_FDCAN1 || tePeripheral == CAN_PERIPHERAL_FDCAN2, STM32CAN_BAD_ARGS, "CAN Transmit Fail, Invalid CAN peripheral selected.");

	for (iFrameCounter = 0; iFrameCounter < iNumberOfFrames; iFrameCounter++)
	{
		// Throw an exception if the TX FIFO is full.
		EH_ASSERT((ptsCANRegisters->FDCAN_TXFQS & 0x200000UL) != 0x200000UL, STM32CAN_TX_FIFO_FULL, "CAN Transmit Fail, TX FIFO is Full.");

		// Get the start address of the TX FIFO.
		iNewElementAddressOffset = STM32CAN_MESSAGE_RAM_ADDRESS + (ptsCANRegisters->FDCAN_TXBC & 0xFFFCUL);
		// Get the put index of the next available TX FIFO buffer.
		iNewElementNumber = ((ptsCANRegisters->FDCAN_TXFQS >> 16) & 0x1FUL);
		// Work out the address of the next available TX FIFO buffer.
		ptsNewTxElement = (tsSTM32CAN_TXFifoElement*)(iNewElementAddressOffset + (iNewElementNumber * STM32CAN_TX_FIFO_ELEMENT_SIZE_BYTES));
		// Store the new entry in the FIFO buffer.
	    ptsNewTxElement->iESI = 0;
	    ptsNewTxElement->iXTD = 1; // Configure identifier to extended 29 bit format.
	    ptsNewTxElement->iRTR = 0; // Set to transmit a data frame.
	    ptsNewTxElement->iID = atsCanFrame[iFrameCounter].iIdentifier & 0x1FFFFFFFUL; // Set the identifier.
	    ptsNewTxElement->iMM = 0;
	    ptsNewTxElement->iEFC = 0; // Do not store TX events.
	    ptsNewTxElement->iFDF = 0; // Configure for classic CAN format.
	    ptsNewTxElement->iBPS = 0; // No bitrate switching.
	    ptsNewTxElement->iDLC = atsCanFrame[iFrameCounter].iDataLength & 0xFUL; // Set the data length code.


	    // Set the first 4 bytes in the data field.
	    for (iDataByteCounter = 0; iDataByteCounter < atsCanFrame[iFrameCounter].iDataLength || iDataByteCounter < 4; iDataByteCounter++)
	    {
	    	iLowerFourBytes |= ((tUINT32)atsCanFrame[iFrameCounter].aData[iDataByteCounter]) << (8 * iDataByteCounter);
	    }

        *(tUINT32*)ptsNewTxElement->aDataBytes = iLowerFourBytes;

        // Set the last 4 bytes in the data field.
	    for (iDataByteCounter = 4; iDataByteCounter < atsCanFrame[iFrameCounter].iDataLength || iDataByteCounter < 8; iDataByteCounter++)
	    {
	    	iUpperFourBytes |= ((tUINT32)atsCanFrame[iFrameCounter].aData[iDataByteCounter]) << (8 * (iDataByteCounter - 4));
	    }

        *(tUINT32*)(ptsNewTxElement->aDataBytes + 4) = iUpperFourBytes;

		// Request transmission by setting the corresponding bit in TXBAR register.
		ptsCANRegisters->FDCAN_TXBAR |= (0x1UL << iNewElementNumber);
	}

	return BT_SUCCESS;

STM32CAN_BAD_ARGS:
	return BT_FAIL;
STM32CAN_TX_FIFO_FULL:
	return BT_FAIL;
}

/**
 * This routine identifies if there are messages in the receive FIFO and presents these messages to
 * the calling routine.
 * @returns SUCCESS always, no exceptions are applicable.
 * @param tePeripheral: teSTM32CAN_PERIPHERAL: The physical CAN bus to receive data from.
 * @param pStartAddressOfRxFIFO: tUINT32*: A pointer to set to the address of the Rx FIFO and then
 * return to the calling function.
 * @param piIndexOfFirst: tUINT32*: The value of the get index. Which will be the first element to
 * read out. Returned to the calling function.
 * @param piNumberOFElementsToRead: tUINT32*: The value of the fifo fill level. The number of elements
 * from the get index that can be read. Returned to the calling function.
 * @param piMaxNumberOFElementsInFIFO: tUINT32*: The maximum number of elements in the buffer.
 * Returned to the calling function.
 * @re-entrant: True
 */
teFUNC_STATUS STM32CAN_Receive(teSTM32CAN_PERIPHERAL tePeripheral, tUINT32* pStartAddressOfRxFIFO, tUINT32* piIndexOfFirst, tUINT32* piNumberOFElementsToRead, tUINT32* piMaxNumberOFElementsInFIFO)
{
	tsSTM32CAN_Registers* ptsCANRegisters = (tsSTM32CAN_Registers*)tePeripheral;
	tUINT32 iPutIndex = 0;
	tUINT32 iPeripheralIndex = 0;

