Open-Source-Satellite/OSSAT_OBC_Dev_Board/OSSAT OBC Dev Test Software/Core/Src/STM32CAN_ContollerAreaNetwork.c
	// Throw an exception if the requested peripheral isn't valid.
	EH_ASSERT(tePeripheral == CAN_PERIPHERAL_FDCAN1 || tePeripheral == CAN_PERIPHERAL_FDCAN2, STM32CAN_BAD_ARGS, "CAN Init Fail, Invalid CAN peripheral selected.");

	// Set the peripheral index so that arrays can be accessed for the correct CAN peripheral.
	if (tePeripheral == CAN_PERIPHERAL_FDCAN2)
	{
		iPeripheralIndex = 1;
	}
	else
	{
		iPeripheralIndex = 0;
	}

	// Get the value of the get index.
	*piIndexOfFirst = (ptsCANRegisters->FDCAN_RXF0S >> 8) & 0x3FUL;
	// Get the start address of the RX FIFO.
	*pStartAddressOfRxFIFO = STM32CAN_MESSAGE_RAM_ADDRESS + (ptsCANRegisters->FDCAN_RXF0C & 0xFFFCUL);
	// Get the value of the put index.
	iPutIndex = (ptsCANRegisters->FDCAN_RXF0S >> 16) & 0x3FUL;
	// Get the number of elements to read.
	*piNumberOFElementsToRead = ptsCANRegisters->FDCAN_RXF0S & 0x7FUL;
	// Get the max number of elements in the FIFO.
	*piMaxNumberOFElementsInFIFO = (ptsCANRegisters->FDCAN_RXF0C >> 16) & 0x7FUL;

	// Set the index of the last element read.
	if (iPutIndex == 0)
	{
		// Set the last read element to the last element in the FIFO.
		aiSTM32CAN_LastElementReadIndex[iPeripheralIndex] = *piMaxNumberOFElementsInFIFO - 1;
	}
	else
	{
		// Set the last read element to the element just before the put index.
		aiSTM32CAN_LastElementReadIndex[iPeripheralIndex] = iPutIndex - 1;
	}

	return BT_SUCCESS;

STM32CAN_BAD_ARGS:
	return BT_FAIL;
}

/**
 * A function that flushes the RX FIFO by acknowledging a read performed by STM32CAN_Receive().
 * Will set the get index to the next element following the last element read, so that the buffers
 * that have been read can now be overwritten with new incoming frames.
 * @return BT_SUCCESS always.
 * @param tePeripheral: teSTM32CAN_PERIPHERAL: The physical CAN bus to flush.
 * @re-entrant: True
 */
teFUNC_STATUS STM32CAN_Flush(teSTM32CAN_PERIPHERAL tePeripheral)
{
	tsSTM32CAN_Registers* ptsCANRegisters = (tsSTM32CAN_Registers*)tePeripheral;
	tUINT32 iPeripheralIndex = 0;

	// Throw an exception if the requested peripheral isn't valid.
	EH_ASSERT(tePeripheral == CAN_PERIPHERAL_FDCAN1 || tePeripheral == CAN_PERIPHERAL_FDCAN2, STM32CAN_BAD_ARGS, "CAN Init Fail, Invalid CAN peripheral selected.");

	// Set the peripheral index so that the arrays of booleans can be accessed for the correct CAN peripheral.
	if (tePeripheral == CAN_PERIPHERAL_FDCAN2)
	{
		iPeripheralIndex = 1;
	}
	else
	{
		iPeripheralIndex = 0;
	}

	// Acknowledge the read by setting the bit in the acknowledge register representing the last element read.
	ptsCANRegisters->FDCAN_RXF0A = aiSTM32CAN_LastElementReadIndex[iPeripheralIndex];

	return BT_SUCCESS;

STM32CAN_BAD_ARGS:
	return BT_FAIL;
}

/**
 * In the event that the CAN controller observes errors (including Bus Off, Error Active & Error
 * Passive). In the event of an Error Passive/Error Active state entry, this event will simply be
 * logged (no recovery is necessary).
 * In the event of a bus off error, the bus off indication is reported to the calling function so that
 * the calling function can decide what to do to recover.
 * This function reads some module scope variables set from the ISR that signifies the transitions
 * between error modes.
 * @throws STM32CAN_BAD_ARGS if the peripheral selected was invalid.
 * @returns SUCCESS unless there is an exception.
 * @param tePeripheral: teSTM32CAN_PERIPHERAL: The physical CAN bus who's errors need handling.
 * @param *pbIsBusOff: tBOOL: If true, the CAN controller is in bus off.
 * @re-entrant: 
 */
teFUNC_STATUS STM32CAN_HandleErrors(teSTM32CAN_PERIPHERAL tePeripheral, tBOOL *pbIsBusOff)
{
	tUINT32 iPeripheralIndex = 0;

	// Throw an exception if the requested peripheral isn't valid.
	EH_ASSERT(tePeripheral == CAN_PERIPHERAL_FDCAN1 || tePeripheral == CAN_PERIPHERAL_FDCAN2, STM32CAN_BAD_ARGS, "CAN Init Fail, Invalid CAN peripheral selected.");

	// Set the peripheral index so that the arrays of booleans can be accessed for the correct CAN peripheral.
	if (tePeripheral == CAN_PERIPHERAL_FDCAN2)
	{
		iPeripheralIndex = 1;
	}
	else
	{
		iPeripheralIndex = 0;
	}

	// Throw an exception if a transition to error active was detected.
	EH_THROW(abSTM32CAN_TransitionToErrorActive[iPeripheralIndex] == FALSE, "CAN Entered Error Active.");
	// Throw an exception if a transition to error passive was detected.
	EH_THROW(abSTM32CAN_TransitionToErrorPassive[iPeripheralIndex] == FALSE, "CAN Entered Error Passive.");

	// If we have transitioned to Bus Off.
	if (abSTM32CAN_TransitionToBusOff[iPeripheralIndex] == TRUE)
	{
		// Throw an exception if a transition to bus off was detected.
		EH_THROW(FALSE, "CAN Entered Bus Off.");
		*pbIsBusOff = TRUE;
	}

	abSTM32CAN_TransitionToErrorActive[iPeripheralIndex] = FALSE;
	abSTM32CAN_TransitionToErrorPassive[iPeripheralIndex] = FALSE;
	abSTM32CAN_TransitionToBusOff[iPeripheralIndex] = FALSE;

	return BT_SUCCESS;

STM32CAN_BAD_ARGS:
	return BT_FAIL;
}

/**
 * This routine is called upon a transmission or reception event such that the service/application
 * layer code can be scheduled in response to CAN frame receptions. This interrupt will only be
 * enabled if a callback is registered for either transmission or reception.
 * @returns BT_SUCCESS unless there is an exception.
 * @param tePeripheral: teSTM32CAN_PERIPHERAL: The physical CAN bus that has kicked off an interrupt.
 * @re-entrant: 
 */
teFUNC_STATUS STM32CAN_ISRTransmissionComplete(teSTM32CAN_PERIPHERAL tePeripheral)
{
	tsSTM32CAN_Registers* ptsCANRegisters = (tsSTM32CAN_Registers*)tePeripheral;
	tUINT32 iPeripheralIndex = 0;

	// Throw an exception if the requested peripheral isn't valid.
	EH_ASSERT(tePeripheral == CAN_PERIPHERAL_FDCAN1 || tePeripheral == CAN_PERIPHERAL_FDCAN2, STM32CAN_BAD_ARGS, "CAN Init Fail, Invalid CAN peripheral selected.");

	// Set the peripheral index so that the arrays of booleans can be accessed for the correct CAN peripheral.
	if (tePeripheral == CAN_PERIPHERAL_FDCAN2)
	{
		iPeripheralIndex = 1;
	}
	else
	{
		iPeripheralIndex = 0;
	}

