Open-Source-Satellite/OSSAT_OBC_Dev_Board/OSSAT OBC Dev Test Software/Core/Src/STM32CAN_ContollerAreaNetwork.c
	// If Transmission Completed.
	if ((ptsCANRegisters->FDCAN_IR & 0x200UL) == 0x200UL)
	{
		// Call the transmit complete callback for CAN1.
		atsSTM32CAN_Callbacks[iPeripheralIndex].pTxCallback();
		// Clear the interrupt.
		ptsCANRegisters->FDCAN_IR |= 0x200UL;
	}
	// If New Message in RX FIFO.
	if ((ptsCANRegisters->FDCAN_IR & 0x1UL) == 0x1UL)
	{
		// Call the reception complete callback for CAN1.
		atsSTM32CAN_Callbacks[iPeripheralIndex].pRxCallback();
		// Clear the interrupt.
		ptsCANRegisters->FDCAN_IR |= 0x1UL;
	}

	return BT_SUCCESS;

STM32CAN_BAD_ARGS:
	return BT_FAIL;
}

/**
 * This routine is called upon CAN errors transitions to and from Error Passive, Error Active and Bus
 * Off.
 * This function sets module scope variables that signify the transition between the CAN error states.
 * 
 * @returns BT_SUCCESS unless there is an exception.
 * @param tePeripheral: teSTM32CAN_PERIPHERAL: The physical CAN bus that has kicked off an interrupt.
 * @re-entrant: 
 */
teFUNC_STATUS STM32CAN_ISRErrorTransition(teSTM32CAN_PERIPHERAL tePeripheral)
{
	tsSTM32CAN_Registers* ptsCANRegisters = (tsSTM32CAN_Registers*)tePeripheral;
	tUINT32 iPeripheralIndex = 0;

	// Throw an exception if the requested peripheral isn't valid.
	EH_ASSERT(tePeripheral == CAN_PERIPHERAL_FDCAN1 || tePeripheral == CAN_PERIPHERAL_FDCAN2, STM32CAN_BAD_ARGS, "CAN Init Fail, Invalid CAN peripheral selected.");

	// Set the peripheral index so that the arrays of booleans can be accessed for the correct CAN peripheral.
	if (tePeripheral == CAN_PERIPHERAL_FDCAN2)
	{
		iPeripheralIndex = 1;
	}
	else
	{
		iPeripheralIndex = 0;
	}

	// Check for which state change has triggered the interrupt.
	if (((ptsCANRegisters->FDCAN_IR & 0x2000000UL) == 0x2000000UL))
	{
		// If state is Bus Off.
		if ((ptsCANRegisters->FDCAN_PSR & 0x80UL) == 0x80UL)
		{
			abSTM32CAN_TransitionToBusOff[iPeripheralIndex] = TRUE;
		}
		// Must have transitioned to Error Active from Initialisation.
		else
		{
			abSTM32CAN_TransitionToErrorActive[iPeripheralIndex] = TRUE;
		}
		// Clear interrupt flags.
		ptsCANRegisters->FDCAN_IR |= 0x2000000UL;
	}
	if (((ptsCANRegisters->FDCAN_IR & 0x800000UL) == 0x800000UL))
	{
		// If state is Error Passive.
		if ((ptsCANRegisters->FDCAN_PSR & 0x20UL) == 0x20UL)
		{
			abSTM32CAN_TransitionToErrorPassive[iPeripheralIndex] = TRUE;
		}
		// Must have transitioned to Error Active.
		else
		{
			abSTM32CAN_TransitionToErrorActive[iPeripheralIndex] = TRUE;
		}
		// Clear interrupt flags.
		ptsCANRegisters->FDCAN_IR |= 0x800000UL;
	}

	return BT_SUCCESS;

STM32CAN_BAD_ARGS:
	return BT_FAIL;
}

/**
 * The STM32 CAN controller can be configured to filter on a number of ranges of CAN IDs (29 bit),
 * this routine will add to the list of filters with a min/max range.
 * @throws STM32CAN_NO_MORE_AVAILABLE_FILTER_SLOTS if there are no more available filter slots for the
 * device.
 * @throws STM32CAN_BAD_ARGS if the filter values are bigger than a 29 bit value, if max is less than
 * min or if requested peripheral is not valid.
 * @returns SUCCESS unless there is an exception.
 * @param tePeripheral: teSTM32CAN_PERIPHERAL: The physical CAN bus to associated this filter to.
 * @param iFilterMin: tUINT32: The minimum filter ID value (inclusive)
 * @param iFilterMax: tUINT32: The maximum filter ID value (inclusive)
 * @re-entrant: 
 */
teFUNC_STATUS STM32CAN_AddFilterRange(teSTM32CAN_PERIPHERAL tePeripheral, tUINT32 iFilterMin, tUINT32 iFilterMax)
{
	tsSTM32CAN_Registers* ptsCANRegisters = (tsSTM32CAN_Registers*)tePeripheral;
	tUINT32 iMaxNumberOfFiltersConfigured = 0;
	tUINT32 iNumberOfFilters = 0;
	tUINT32 iExtendedFiltersStartAddress = 0;
	tsSTM32CAN_ExtendedIDFilterElement* pNewFilterEntryAddress = 0;

	// Throw an exception if the requested peripheral isn't valid.
	EH_ASSERT(tePeripheral == CAN_PERIPHERAL_FDCAN1 || tePeripheral == CAN_PERIPHERAL_FDCAN2, STM32CAN_BAD_ARGS, "CAN Add Filter Accept Mask Fail, Invalid CAN peripheral selected.");
	// Throw an exception if the range filter min is bigger than a 29 bit value.
	EH_ASSERT(iFilterMin <= STM32CAN_EXTENDED_FILTER_ID_MAXIMUM_VALUE , STM32CAN_BAD_ARGS, "CAN Add Range Filter Fail, Requested Min Value is Larger than a 29 bit value.");
	// Throw an exception if the range filter max value is bigger than a 29 bit value.
	EH_ASSERT(iFilterMax <= STM32CAN_EXTENDED_FILTER_ID_MAXIMUM_VALUE, STM32CAN_BAD_ARGS, "CAN Add Range Filter Fail, Requested Max Value is Larger than a 29 bit value.");
	// Throw an exception if the range filter max value is smaller than the min value.
	EH_ASSERT(iFilterMin <= iFilterMax, STM32CAN_BAD_ARGS, "CAN Add Range Filter Fail, Requested Max Value is Smaller than the Min value.");

	// Work out the maximum filters configured at initialisation.
		iMaxNumberOfFiltersConfigured = (ptsCANRegisters->FDCAN_RXF0C & 0xFFFCUL) / STM32CAN_EXTENDED_FILTER_SIZE_BYTES;
	// Find the number of current filters already configured.
	iNumberOfFilters = ptsCANRegisters->FDCAN_XIDFC >> 16UL;
	// Throw an exception if there are no more available filter slots.
	EH_ASSERT(iNumberOfFilters < iMaxNumberOfFiltersConfigured && iNumberOfFilters <= STM32CAN_MAX_EXTENDED_FILTERS, STM32CAN_NO_MORE_AVAILABLE_FILTER_SLOTS, "CAN Add Filter Accept Mask Fail, No More Filter Slots");
	// Find the start address of the extended filters section
	iExtendedFiltersStartAddress = (ptsCANRegisters->FDCAN_XIDFC & 0xFFFCUL);
	// Find the address of the new filter entry.
	pNewFilterEntryAddress = (tsSTM32CAN_ExtendedIDFilterElement*)(STM32CAN_MESSAGE_RAM_ADDRESS + iExtendedFiltersStartAddress + (iNumberOfFilters * STM32CAN_EXTENDED_FILTER_SIZE_BYTES));

	// Add the new filter into the message RAM.
	pNewFilterEntryAddress->iEFEC = 1UL; // Configure filter to store message in FIFO if matches.
	pNewFilterEntryAddress->iEFID1 = iFilterMin & 0x1FFFFFFFUL; // Configure the range filter minimum ID.
	pNewFilterEntryAddress->iEFTI = 2UL; // Configure filter as classic acceptance mask.
	pNewFilterEntryAddress->iEFID2 = iFilterMax & 0x1FFFFFFFUL; // Configure the range filter maximum ID.

	// Increment the number of filters by 1 and add to the XIDFC register.
	iNumberOfFilters++;
	ptsCANRegisters->FDCAN_XIDFC |= ((iNumberOfFilters << 16UL) & 0xFFFFFCUL);

	return BT_SUCCESS;

STM32CAN_BAD_ARGS:
	return BT_FAIL;
STM32CAN_NO_MORE_AVAILABLE_FILTER_SLOTS:
	return BT_FAIL;
}

/**
 * The STM32 can be configured to filter incoming CAN frames by ID through a "don't care" mask and an
 * acceptance filter (29 bit). This routine adds an acceptance mask/filter.
 * @throws STM32CAN_NO_MORE_AVAILABLE_FILTER_SLOTS if there are no more available filter slots for the
 * device.
 * @throws STM32CAN_BAD_ARGS if the filter values are bigger than a 29 bit value or if requested
 * peripheral is not valid.
 * @returns SUCCESS unless there is an exception.
 * @param tePeripheral: teSTM32CAN_PERIPHERAL: The physical CAN bus to associate the filter to.
 * @param iAcceptanceFilter: tUINT32: The acceptance filter value
 * @param iAcceptanceMask: tUINT32: The mask defining which bits will be ignored during the
 * application of the acceptance filter.
 * @re-entrant: 
 */
teFUNC_STATUS STM32CAN_AddFilterAcceptMask(teSTM32CAN_PERIPHERAL tePeripheral, tUINT32 iAcceptanceFilter, tUINT32 iAcceptanceMask)
{
	tsSTM32CAN_Registers* ptsCANRegisters = (tsSTM32CAN_Registers*)tePeripheral;
	tUINT32 iMaxNumberOfFiltersConfigured = 0;
	tUINT32 iNumberOfFilters = 0;
	tUINT32 iExtendedFiltersStartAddress = 0;
	tsSTM32CAN_ExtendedIDFilterElement* pNewFilterEntryAddress = 0;

