Open-Source-Satellite/OSSAT_OBC_Dev_Board/OSSAT OBC Dev Test Software/Core/Src/STM32CAN_ContollerAreaNetwork.c
	// Throw an exception if the requested peripheral isn't valid.
	EH_ASSERT(tePeripheral == CAN_PERIPHERAL_FDCAN1 || tePeripheral == CAN_PERIPHERAL_FDCAN2, STM32CAN_BAD_ARGS, "CAN Add Filter Accept Mask Fail, Invalid CAN peripheral selected.");
	// Throw an exception if the acceptance filter value is bigger than a 29 bit value.
	EH_ASSERT(iAcceptanceFilter <= STM32CAN_EXTENDED_FILTER_ID_MAXIMUM_VALUE, STM32CAN_BAD_ARGS, "CAN Add Accept Mask Filter Fail, Requested Filter Value is Larger than a 29 bit value.");
	// Throw an exception if the acceptance mask value is bigger than a 29 bit value.
	EH_ASSERT(iAcceptanceMask <= STM32CAN_EXTENDED_FILTER_ID_MAXIMUM_VALUE, STM32CAN_BAD_ARGS, "CAN Add Accept Mask Filter Fail, Requested Mask Value is Larger than a 29 bit value.");

	// Work out the maximum filters configured at initialisation.
	iMaxNumberOfFiltersConfigured = (ptsCANRegisters->FDCAN_RXF0C & 0xFFFCUL) / STM32CAN_EXTENDED_FILTER_SIZE_BYTES;
	// Find the number of current filters already configured.
	iNumberOfFilters = ptsCANRegisters->FDCAN_XIDFC >> 16UL;
	// Throw an exception if there are no more available filter slots.
	EH_ASSERT(iNumberOfFilters < iMaxNumberOfFiltersConfigured && iNumberOfFilters <= STM32CAN_MAX_EXTENDED_FILTERS, STM32CAN_NO_MORE_AVAILABLE_FILTER_SLOTS, "CAN Add Filter Accept Mask Fail, No More Filter Slots");
	// Find the start address of the extended filters section
	iExtendedFiltersStartAddress = (ptsCANRegisters->FDCAN_XIDFC & 0xFFFCUL);
	// Find the address of the new filter entry.
	pNewFilterEntryAddress = (tsSTM32CAN_ExtendedIDFilterElement*)(STM32CAN_MESSAGE_RAM_ADDRESS + iExtendedFiltersStartAddress + (iNumberOfFilters * STM32CAN_EXTENDED_FILTER_SIZE_BYTES));

	// Add the new filter into the message RAM.
	pNewFilterEntryAddress->iEFEC = 1UL; // Configure filter to store message in FIFO if matches.
	pNewFilterEntryAddress->iEFID1 = iAcceptanceFilter & 0x1FFFFFFFUL; // Configure the acceptance filter.
	pNewFilterEntryAddress->iEFTI = 2UL; // Configure filter as classic acceptance mask.
	pNewFilterEntryAddress->iEFID2 = iAcceptanceMask & 0x1FFFFFFFUL; // Configure the acceptance mask.

	// Increment the number of filters by 1 and add to the XIDFC register.
	iNumberOfFilters++;
	ptsCANRegisters->FDCAN_XIDFC |= ((iNumberOfFilters << 16UL) & 0xFFFFFCUL);

	return BT_SUCCESS;

STM32CAN_BAD_ARGS:
	return BT_FAIL;
STM32CAN_NO_MORE_AVAILABLE_FILTER_SLOTS:
	return BT_FAIL;
}

/**
 * Following the call to initialise and the call to add filters for frame reception, this call
 * connects the CAN controller to the CAN bus through the CAN transceiver.
 * @returns SUCCESS unless there is an exception.
 * @throws STM32CAN_BAD_ARGS if any arguments are invalid.
 * @param tePeripheral: teSTM32CAN_PERIPHERAL: The physical CAN bus to connect.
 * @re-entrant: 
 */
teFUNC_STATUS STM32CAN_Connect(teSTM32CAN_PERIPHERAL tePeripheral)
{
	// Throw an exception if the requested peripheral isn't valid.
	EH_ASSERT(tePeripheral == CAN_PERIPHERAL_FDCAN1 || tePeripheral == CAN_PERIPHERAL_FDCAN2, STM32CAN_BAD_ARGS, "CAN Init Fail, Invalid CAN peripheral selected.");

	tsSTM32CAN_Registers* ptsCANRegisters = (tsSTM32CAN_Registers*)tePeripheral;

	// Throw an exception if the CAN is already connected to the bus.
	EH_ASSERT((ptsCANRegisters->FDCAN_CCCR & 0x1UL) == 0x1UL, STM32CAN_CONNECTED, "CAN Connect Fail, Already Connected To The Bus.");

	// Connect to the bus by clearing the INIT bit in FDCAN_CCCR register.
	ptsCANRegisters->FDCAN_CCCR &= ~0x1UL;
	// The node will now be live on the bus. CCE bit is automatically cleared if set.

	return BT_SUCCESS;

STM32CAN_BAD_ARGS:
	return BT_FAIL;
STM32CAN_CONNECTED:
	return BT_FAIL;
}

/**
 * This function registers callbacks that will be triggered if a message is either received or
 * transmitted.
 * @param tePeripheral: teSTM32CAN_PERIPHERAL: The physical CAN bus to connect the callbacks to.
 * @param pReceiveCallback(): tFUNC_PTR: A pointer to the function that is called in the event of a
 * frame reception.
 * @param pTransmitCallback(): tFUNC_PTR: A pointer to the function that is called in the event of a
 * frame transmission.
 * @re-entrant: 
 */
teFUNC_STATUS STM32CAN_RegisterCallbacks(teSTM32CAN_PERIPHERAL tePeripheral, tFUNC_PTR pReceiveCallback, tFUNC_PTR pTransmitCallback)
{
	tsSTM32CAN_Registers* ptsCANRegisters = (tsSTM32CAN_Registers*)tePeripheral;
	tUINT32 iPeripheralIndex = 0;

	// Throw an exception if the requested peripheral isn't valid.
	EH_ASSERT(tePeripheral == CAN_PERIPHERAL_FDCAN1 || tePeripheral == CAN_PERIPHERAL_FDCAN2, STM32CAN_BAD_ARGS, "CAN Init Fail, Invalid CAN peripheral selected.");

	// Set the peripheral index so that the arrays of booleans can be accessed for the correct CAN peripheral.
	if (tePeripheral == CAN_PERIPHERAL_FDCAN2)
	{
		iPeripheralIndex = 1;
	}
	else
	{
		iPeripheralIndex = 0;
	}

	// If a receive callback is defined.
	if(pReceiveCallback)
	{
		// Register the receive callback for FDCAN1.
		atsSTM32CAN_Callbacks[iPeripheralIndex].pRxCallback = pReceiveCallback;
		// Enable the RX FIFO new message interrupt.
		ptsCANRegisters->FDCAN_IE |= 0x1UL;
		// Attach the interrupt to interrupt line 0.
		ptsCANRegisters->FDCAN_ILS &= ~0x1UL;
		// Enable interrupt line 0.
		ptsCANRegisters->FDCAN_ILE |= 0x1UL;
	}
	// If a transmit callback is defined.
	if(pTransmitCallback)
	{
		// Register the transmit callback for FDCAN1.
		atsSTM32CAN_Callbacks[iPeripheralIndex].pTxCallback = pTransmitCallback;
		// Enable the transmission complete interrupt.
		ptsCANRegisters->FDCAN_IE |= 0x200UL;
		// Attach the interrupt to interrupt line 0.
		ptsCANRegisters->FDCAN_ILS &= ~0x200UL;
		// Enable interrupt line 0.
		ptsCANRegisters->FDCAN_ILE |= 0x1UL;
	}

	return BT_SUCCESS;

STM32CAN_BAD_ARGS:
	return BT_FAIL;
}

/**
 * This function stops transmission on the selected CAN peripheral. This is needed in the case where
 * the CAN transmission goes on for a pre-longed period of time. Under CAN 2.0b protocol, the
 * transmitter will transmit the same frame repeatedly until it receives an acknowledgement in the ACK
 * bit slot from the receiver.
 * In the case that the transmitter ends up transmitting data at a different baud rate, this can
 * prevent further transmissions on the CAN bus.
 * 
 * @returns SUCCESS always, no exceptions need to be handled. 
 * @param tePeripheral: teSTM32CAN_PERIPHERAL: The physical CAN bus for the transmission is to be
 * halted.
 * @re-entrant: 
 */
teFUNC_STATUS STM32CAN_CancelTransmission(teSTM32CAN_PERIPHERAL tePeripheral)
{
	tsSTM32CAN_Registers* ptsCANRegisters = (tsSTM32CAN_Registers*)tePeripheral;
	tUINT32 iCancelElementNumber = 0;

