Open-Source-Satellite/OSSAT_OBC_Dev_Board/OSSAT OBC Dev Test Software/Core/Src/STM32CAN_ContollerAreaNetwork.c
	// Throw an exception if the requested peripheral isn't valid.
	EH_ASSERT(tePeripheral == CAN_PERIPHERAL_FDCAN1 || tePeripheral == CAN_PERIPHERAL_FDCAN2, STM32CAN_BAD_ARGS, "CAN Init Fail, Invalid CAN peripheral selected.");

	// Get the current get index of the TX FIFO.
	iCancelElementNumber = ((ptsCANRegisters->FDCAN_TXFQS >> 8) & 0x1FUL);

	// Cancel the current TX FIFO buffer pointed to by the get index.
	ptsCANRegisters->FDCAN_TXBCR |= 0x1UL << iCancelElementNumber;

	return BT_SUCCESS;

STM32CAN_BAD_ARGS:
	return BT_FAIL;
}

/**
 * This call disconnects the CAN controller from the CAN bus. This puts the CAN controller in
 * initialisation mode, configure the CAN by calling the initialise function.
 * @returns SUCCESS unless there is an exception.
 * @throws STM32CAN_BAD_ARGS if any arguments are invalid.
 * @param tePeripheral: teSTM32CAN_PERIPHERAL: The physical CAN bus to disconnect.
 * @re-entrant: 
 */
teFUNC_STATUS STM32CAN_Disconnect(teSTM32CAN_PERIPHERAL tePeripheral)
{
	// Throw an exception if the requested peripheral isn't valid.
	EH_ASSERT(tePeripheral == CAN_PERIPHERAL_FDCAN1 || tePeripheral == CAN_PERIPHERAL_FDCAN2, STM32CAN_BAD_ARGS, "CAN Init Fail, Invalid CAN peripheral selected.");

	tsSTM32CAN_Registers* ptsCANRegisters = (tsSTM32CAN_Registers*)tePeripheral;

	// Throw an exception if the CAN is already disconnected from the bus.
	EH_ASSERT((ptsCANRegisters->FDCAN_CCCR & 0x1UL) == 0x0UL, STM32CAN_DISCONNECTED, "CAN Disconnect Fail, Already Disconnected.");

	// Connect to the bus by setting the INIT bit in FDCAN_CCCR register.
	ptsCANRegisters->FDCAN_CCCR |= 0x1UL;
	// The node will now be disconnected from the bus.

	return BT_SUCCESS;

STM32CAN_BAD_ARGS:
	return BT_FAIL;
STM32CAN_DISCONNECTED:
	return BT_FAIL;
}

void EH_Exception(char* sFile, char* sLine, char* sErrorString)
{
	HAL_UART_Transmit(&huart3, sErrorString, 120, 1000);
}
